BaMI805PGZcUxQ36.html

<h2 style="padding: 10px 0 10px 0; display: block; border-top: solid 2px #000000; border-bottom: solid 2px #000000;">
			[2014-07-31 06:06:22]</h2><h2>Function 'getCourierOrderAvailabilityV1' params
			</h2><pre>Array
(
    [0] => Array
        (
            [senderPlaceV1] => Array
                (
                    [countryCode] => PL
                    [zipCode] => 30732
                )

        )

)
</pre><h2>Request</h2><pre>&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot;?&gt;
&lt;SOAP-ENV:Envelope xmlns:SOAP-ENV=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot; xmlns:ns1=&quot;http://dpdservices.dpd.com.pl/&quot;&gt;
    &lt;SOAP-ENV:Body&gt;
        &lt;ns1:getCourierOrderAvailabilityV1&gt;
            &lt;senderPlaceV1&gt;
                &lt;countryCode&gt;PL&lt;/countryCode&gt;
                &lt;zipCode&gt;30732&lt;/zipCode&gt;
            &lt;/senderPlaceV1&gt;
            &lt;authDataV1&gt;
                &lt;login&gt;test&lt;/login&gt;
                &lt;masterFid&gt;256985&lt;/masterFid&gt;
                &lt;password&gt;KqvsoFLT2M&lt;/password&gt;
            &lt;/authDataV1&gt;
        &lt;/ns1:getCourierOrderAvailabilityV1&gt;
    &lt;/SOAP-ENV:Body&gt;
&lt;/SOAP-ENV:Envelope&gt;
</pre><h2>Response</h2><pre>stdClass Object
(
    [ranges] => Array
        (
            [0] => stdClass Object
                (
                    [offset] => 120
                    [range] => 13:00-16:00
                )

            [1] => stdClass Object
                (
                    [offset] => 120
                    [range] => 14:00-17:00
                )

            [2] => stdClass Object
                (
                    [offset] => 120
                    [range] => 15:00-18:00
                )

            [3] => stdClass Object
                (
                )

        )

    [status] => OK
)
</pre><h2 style="padding: 10px 0 10px 0; display: block; border-top: solid 2px #000000; border-bottom: solid 2px #000000;">
			[2014-07-31 05:56:38]</h2><h2>Function 'getCourierOrderAvailabilityV1' params
			</h2><pre>Array
(
    [0] => Array
        (
            [senderPlaceV1] => Array
                (
                    [countryCode] => PL
                    [zipCode] => 30732
                )

        )

)
</pre><h2>Request</h2><pre>&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot;?&gt;
&lt;SOAP-ENV:Envelope xmlns:SOAP-ENV=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot; xmlns:ns1=&quot;http://dpdservices.dpd.com.pl/&quot;&gt;
    &lt;SOAP-ENV:Body&gt;
        &lt;ns1:getCourierOrderAvailabilityV1&gt;
            &lt;senderPlaceV1&gt;
                &lt;countryCode&gt;PL&lt;/countryCode&gt;
                &lt;zipCode&gt;30732&lt;/zipCode&gt;
            &lt;/senderPlaceV1&gt;
            &lt;authDataV1&gt;
                &lt;login&gt;test&lt;/login&gt;
                &lt;masterFid&gt;256985&lt;/masterFid&gt;
                &lt;password&gt;KqvsoFLT2M&lt;/password&gt;
            &lt;/authDataV1&gt;
        &lt;/ns1:getCourierOrderAvailabilityV1&gt;
    &lt;/SOAP-ENV:Body&gt;
&lt;/SOAP-ENV:Envelope&gt;
</pre><h2>Response</h2><pre>stdClass Object
(
    [ranges] => Array
        (
            [0] => stdClass Object
                (
                    [offset] => 120
                    [range] => 13:00-16:00
                )

            [1] => stdClass Object
                (
                    [offset] => 120
                    [range] => 14:00-17:00
                )

            [2] => stdClass Object
                (
                    [offset] => 120
                    [range] => 15:00-18:00
                )

            [3] => stdClass Object
                (
                )

        )

    [status] => OK
)
</pre><h2 style="padding: 10px 0 10px 0; display: block; border-top: solid 2px #000000; border-bottom: solid 2px #000000;">
			[2014-07-31 05:56:32]</h2><h2>Function 'getCourierOrderAvailabilityV1' params
			</h2><pre>Array
(
    [0] => Array
        (
            [senderPlaceV1] => Array
                (
                    [countryCode] => PL
                    [zipCode] => 30732
                )

        )

)
</pre><h2>Request</h2><pre>&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot;?&gt;
&lt;SOAP-ENV:Envelope xmlns:SOAP-ENV=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot; xmlns:ns1=&quot;http://dpdservices.dpd.com.pl/&quot;&gt;
    &lt;SOAP-ENV:Body&gt;
        &lt;ns1:getCourierOrderAvailabilityV1&gt;
            &lt;senderPlaceV1&gt;
                &lt;countryCode&gt;PL&lt;/countryCode&gt;
                &lt;zipCode&gt;30732&lt;/zipCode&gt;
            &lt;/senderPlaceV1&gt;
            &lt;authDataV1&gt;
                &lt;login&gt;test&lt;/login&gt;
                &lt;masterFid&gt;256985&lt;/masterFid&gt;
                &lt;password&gt;KqvsoFLT2M&lt;/password&gt;
            &lt;/authDataV1&gt;
        &lt;/ns1:getCourierOrderAvailabilityV1&gt;
    &lt;/SOAP-ENV:Body&gt;
&lt;/SOAP-ENV:Envelope&gt;
</pre><h2>Response</h2><pre>stdClass Object
(
    [ranges] => Array
        (
            [0] => stdClass Object
                (
                    [offset] => 120
                    [range] => 13:00-16:00
                )

            [1] => stdClass Object
                (
                    [offset] => 120
                    [range] => 14:00-17:00
                )

            [2] => stdClass Object
                (
                    [offset] => 120
                    [range] => 15:00-18:00
                )

            [3] => stdClass Object
                (
                )

        )

    [status] => OK
)
</pre><h2 style="padding: 10px 0 10px 0; display: block; border-top: solid 2px #000000; border-bottom: solid 2px #000000;">
			[2014-07-31 05:56:29]</h2><h2>Function 'getCourierOrderAvailabilityV1' params
			</h2><pre>Array
(
    [0] => Array
        (
            [senderPlaceV1] => Array
                (
                    [countryCode] => PL
                    [zipCode] => 30732
                )

        )

)
</pre><h2>Request</h2><pre>&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot;?&gt;
&lt;SOAP-ENV:Envelope xmlns:SOAP-ENV=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot; xmlns:ns1=&quot;http://dpdservices.dpd.com.pl/&quot;&gt;
    &lt;SOAP-ENV:Body&gt;
        &lt;ns1:getCourierOrderAvailabilityV1&gt;
            &lt;senderPlaceV1&gt;
                &lt;countryCode&gt;PL&lt;/countryCode&gt;
                &lt;zipCode&gt;30732&lt;/zipCode&gt;
            &lt;/senderPlaceV1&gt;
            &lt;authDataV1&gt;
                &lt;login&gt;test&lt;/login&gt;
                &lt;masterFid&gt;256985&lt;/masterFid&gt;
                &lt;password&gt;KqvsoFLT2M&lt;/password&gt;
            &lt;/authDataV1&gt;
        &lt;/ns1:getCourierOrderAvailabilityV1&gt;
    &lt;/SOAP-ENV:Body&gt;
&lt;/SOAP-ENV:Envelope&gt;
</pre><h2>Response</h2><pre>stdClass Object
(
    [ranges] => Array
        (
            [0] => stdClass Object
                (
                    [offset] => 120
                    [range] => 13:00-16:00
                )

            [1] => stdClass Object
                (
                    [offset] => 120
                    [range] => 14:00-17:00
                )

            [2] => stdClass Object
                (
                    [offset] => 120
                    [range] => 15:00-18:00
                )

            [3] => stdClass Object
                (
                )

        )

    [status] => OK
)
</pre>